import React from 'react';
import { Link } from 'react-router-dom';
import List from '@mui/material/List';
import ListItem from '@mui/material/ListItem';
import ListItemAvatar from '@mui/material/ListItemAvatar';
import ListItemText from '@mui/material/ListItemText';
import Avatar from '@mui/material/Avatar';
import Divider from '@mui/material/Divider';
import Typography from '@mui/material/Typography';

const latestLyrics = [{ 
  title: "༧གོང་ས་མཆོག་འཛམ་གླིང་གི་ཉི་མ།", 
  singer: "ཨ་མཆོག་མགོན་པོ།", 
  lyricist:"ཁ་སྒང་སྤྱན་འབངས།", 
  composer:"ཡོན་ཏན་མགོན་པོ།",
  lyrics: "ནངས་སྔ་མོའི་སྐྱ་རེངས་ཀྱི་འཛུམ་གདངས། \n \
  འཛུམ་མདངས་དེའི་ཁྲོད་ན། \n \
  དད་སེམས་དང་གསོལ་འདེབས་དབྱངས་ལ་འགུག་བཞིན་ང་ཚོས། \n \
  འཛམ་གླིང་གི་སེམས་དཔའ་ཆེན་མོའི་འཁྲུངས་སྐར་བསུ། \n \
  ༧གོང་ས་མཆོག་ལ་སྐུ་ཚེ་ཁྲི་ལོར་བརྟན་པར་ཤོག \n \
  སྨོན་འདུན་དང་དགོད་སྒྲ་ངག་ལ་གྱེར་ནས། \n \
  བོད་གཞིས་བྱེས་གཉིས་ནས་འཁྲུངས་སྐར་བསུ། \n \
  ཨོ་ཧོ།  འཁྲུངས་སྐར་ལ་རྟེན་འབྲེལ་ཞུ། འཁྲུངས་སྐར་ལ་རྟེན་འབྲེལ་ཞུ། \n \
  ༧གོང་ས་རྒྱལ་བ་བསྟན་འཛིན་རྒྱ་མཚོ་ཡི། \n \
  འཁྲུངས་སྐར་ལ་བཀྲ་ཤིས་སྨོན་འདུན་ཞུ། \n \
  སྨོན་འདུན་ཞུ། \n \
  ནངས་སྔ་མོའི་སྐྱ་རེངས་ཀྱི་འཛུམ་གདངས། \n \
  འཛུམ་མདངས་དེའི་ཁྲོད་ན། \n \
  ལྷ་བསང་དང་རླུང་རྟ་དགུང་ལ་གཏོར་བཞིན་ང་ཚོས། \n \
  འཛམ་གླིང་གི་སེམས་དཔའ་ཆེན་མོའི་འཁྲུངས་སྐར་བསུ། \n \
  ༧གོང་ས་མཆོག་ལ་སྐུ་ཚེ་ཁྲི་ལོར་བརྟན་པར་ཤོག \n \
  ཁ་གཡང་དང་ལྷ་དར་ལག་ལ་བཟུང་ནས། \n \
  བོད་གཞིས་བྱེས་གཉིས་ནས་འཁྲུངས་སྐར་བསུ། \n \
  ཨོ་ཧོ།  འཁྲུངས་སྐར་ལ་རྟེན་འབྲེལ་ཞུ། འཁྲུངས་སྐར་ལ་རྟེན་འབྲེལ་ཞུ། \n \
  ༧གོང་ས་རྒྱལ་བ་བསྟན་འཛིན་རྒྱ་མཚོ་ཡི། \n \
  འཁྲུངས་སྐར་ལ་བཀྲ་ཤིས་སྨོན་འདུན་ཞུ། \n \
  སྨོན་འདུན་ཞུ། \n \
  ཨོ་ཧོ།  འཁྲུངས་སྐར་ལ་རྟེན་འབྲེལ་ཞུ། འཁྲུངས་སྐར་ལ་རྟེན་འབྲེལ་ཞུ། \n \
  ༧གོང་ས་རྒྱལ་བ་བསྟན་འཛིན་རྒྱ་མཚོ་ཡི། \n \
  འཁྲུངས་སྐར་ལ་བཀྲ་ཤིས་སྨོན་འདུན་ཞུ། \n \
  སྨོན་འདུན་ཞུ། \n \
  འཁྲུངས་སྐར་ལ་བཀྲ་ཤིས་སྨོན་འདུན་ཞུ། \n \
  སྨོན་འདུན་ཞུ།"},
  {
    "title": "རང་མ་གཏོགས།",
    "singer": "ཚེ་དབང་ནོར་བུ།",
    "lyricist": "ཚེ་དབང་ནོར་བུ།",
    "composer": "ཚེ་དབང་ནོར་བུ།",
    "lyrics": "བསམ་རྒྱུ་རང་ལས་མི་འདུག  \n \
  དྲན་རྒྱུ་རང་ལས་མི་འདུག  \n \
  ཆུ་ཚོད་ཉི་ཤུ་རྩ་བཞི། སྐར་མ་ཆིག་སྟོང་བཞི་བརྒྱ་བཞི་བཅུ།  \n \
  རང་གཅིག་པོ་ལས་མི་འདུག  \n \
  ངའི་སྙིང་ཁང་ནི་ཁྱེད་རང་གཅིག་པོའི་གནས་ས་ཡིན།  \n \
  ངའི་ལག་པ་ཁྱེད་རང་གཅིག་པོར་མ་གཏོགས་གཏོང་འདོད་མེད།  \n \
  ངའི་རེ་བར་བུ་ཆུང་ཁྱེད་རང་མ་གཏོགས།  \n \
  སུ་གང་མཉམ་དུ་སྐར་ཆ་གཅིག་ཀྱང་།  \n \
  བསྡད་འདོད་མེད་ལ་འཚོ་བ་བསྐྱལ་འདོད་མེད།  \n \
  ལས་དབང་དེ་ནི་ཆོ་ཚ་བ། རང་དང་འཕྲད་པ་དེ་གང་རེད།  \n \
  བརྩེ་དུང་དེ་ནི་དགོད་བྲོ་བ། དང་ཐོག་དེ་འདྲ་མ་རེད།  \n \
  རང་ནི་དེ་འདྲའི་ཤེས་དཀའ་བ། འཆར་གཞི་ག་རེ་ཡོད་མེད།  \n \
  ང་གཉིས་བརྩེ་དུང་ནང་དིམ་ནས་ འཕུར་འགྲོ་འཕུར་འགྲོ  \n \
  བསམ་རྒྱུ་རང་ལས་མི་འདུག  \n \
  དྲན་རྒྱུ་རང་ལས་མི་འདུག  \n \
  ཆུ་ཚོད་ཉི་ཤུ་རྩ་བཞི། སྐར་མ་ཆིག་སྟོང་བཞི་བརྒྱ་བཞི་བཅུ།  \n \
  རང་གཅིག་པོ་ལས་མི་འདུག  \n \
  རང་ཆེད་དུ་འཚོ་བ་བློས་བཏང་རུང་འགྱོད་པ་མེད།  \n \
  རང་ཆེད་དུ་ཕུགས་བསམ་བློས་བཏང་རུང་འགྱོད་པ་མེད།  \n \
  རང་ཆེད་དུ་ཡོད་ཚད་བློས་བཏང་རུང་།  \n \
  ང་གཉིས་ལག་པ་བཏང་ནས།  \n \
  མཉམ་དུ་འཚོ་བ་བསྐྱལ་རྒྱུའི་སེམས་ཤུགས་སེམས་ཤུགས་ཡོད།  \n \
  དབུགས་བཏང་ དབུགས་བཏང་ \n \
  རང་མཉམ་དུ་དབུགས་བཏང་། \n \
  རང་མཉམ་དུ་འཚོ་བ་བསྐྱལ་རྒྱུའི་སེམས་ཤུགས་ཡོད། \n \
  ངའི་སྙིང་ཁང་ནི་ཁྱེད་རང་གཅིག་པོའི་གནས་ས་ཡིན། \n \
  ངའི་ལག་པ་ཁྱེད་རང་གཅིག་པོར་མ་གཏོགས་གཏོང་འདོད་མེད། \n \
  ངའི་རེ་བར་བུ་ཆུང་ཁྱེད་རང་མ་གཏོགས། \n \
  སུ་གང་མཉམ་དུ་སྐར་ཆ་གཅིག་ཀྱང་། \n \
  བསྡད་འདོད་མེད་ལ་འཚོ་བ་བསྐྱལ་འདོད་མེད"}
  ,
  
    {
      "title": "སེམས་ཀྱི་མེ་ཏོག",
      "singer": "གཤེར་བརྟེན",
      "lyricist": "གཤེར་བརྟེན",
      "composer": "གཤེར་བརྟེན",
      "lyrics": "ངའི་མེ་ཏོག  ངའི་སྙིང་སྡུག \n \
  ཞལ་རས་དུང་གི་ཟླ་བ་རེད། \n \
  ཟླ་་བ་རེད། ཟླ་བ་ལྷ་མོའི་འཛུམ། \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  དུས་གསུམ་ཀུན་གྱི་བདག་མོ་རེད། \n \
  བདག་མོ་རེད་དབྱངས་ཅན་ལྷ་མོའི་ཉམས། \n \
  ཨོ། \n \
  མེ་ཏོག་དམར་པོ་ལས་སྐལ་རེད། \n \
  ཨོ། \n \
  སྒྲོལ་མ་དཀར་མོའི་མགུར་དབྱངས་རེད། \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  ངའི་མེ་ཏོག \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  ཐུལ་དཀར་འབྲི་མོའིེ་བཞོ་དབྱངས་རེད། \n \
  བཞོ་དབྱངས་རེད། དགོ་དགོ་ངག་གི་གདངས། \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  འབྲུ་དྲུག་ཞིང་གི་བདག་མོ་རེད། \n \
  བདག་མོ་རེད། གསེར་མདོག་སྙེ་མའི་རླབས། \n \
  ཨོ། \n \
  དབྱར་གཞུང་ཐང་གི་མེ་ཏོག་རེད། \n \
  ཨོ། \n \
  གངས་དཀར་ཨ་མའི་འཛུམ་གདངས་རེད། \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  ངའི་མེ་ཏོག \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  ངའི་མེ་ཏོག \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  བརྕེ་བ་གངས་ཀྱི་འདབ་མ་རེད། \n \
  འདབ་མ་རེད། དུང་མདོག་ཁ་བའི་བརྒྱན། \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག \n \
  དུང་བ་མཚོ་བའི་སྤང་རྒྱན་རེད། \n \
  སྤང་རྒྱན་རེད། ཆུང་གྲོགས་བྱམས་པའི་མདངས། \n \
  ཨོ། \n \
  སྙིང་གཅེས་སེམས་ཀྱི་མི་ཏོག་རེད། \n \
  ཨོ། \n \
  རང་འབྱུང་ངག་གི་མཆོད་པ་རེད། \n \
  ངའི་མེ་ཏོག ངའི་སྙིང་སྡུག"
    }  
  ];
function Home() {
  return (
    <div style={{
      display:'flex',
      flexDirection:'column',
      marginLeft:'10%',
    }}>
      <h1>གཞས་ཚིག་གསར་སྣོན།</h1>
      <List sx={{ width: '100%', maxWidth: 360, bgcolor: 'background.paper' , ml:'10%'}}>
        {latestLyrics.map((song, index) => (
          <React.Fragment key={index}>
            <ListItem alignItems="flex-start">
              <ListItemAvatar>
                <Avatar alt={song.singer} src="/static/images/avatar/1.jpg" />
              </ListItemAvatar>
              <ListItemText
                primary={
                  <Link to={`/songs/${encodeURIComponent(song.title)}`} style={{textDecoration:'none'}}>
                    {song.title}
                  </Link>
                }
                secondary={
                  <React.Fragment>
                    <Typography
                      component="span"
                      variant="body2"
                      sx={{ color: 'text.primary', display: 'block', textAlign: 'left' ,ml:'50%'}}
                    >
                      གཞས་པ། {song.singer}
                    </Typography>
                    <Typography
                      component="span"
                      variant="body2"
                      sx={{ color: 'text.primary', display: 'block', textAlign: 'left', ml:'50%'}}
                    >
                      གདངས། {song.composer}
                    </Typography>
                    <Typography
                      component="span"
                      variant="body2"
                      sx={{ color: 'text.primary', display: 'block', textAlign: 'left' , ml:'50%'}}
                    >
                      ཚིག {song.lyricist}
                    </Typography>

                  </React.Fragment>
                }
              />
            </ListItem>
            <Divider variant="inset" component="li" />
          </React.Fragment>
        ))}
      </List>
    </div>
  );
}

export default Home;
